#+TITLE: `cage`
#+DATE: <2019-01-24 Thu>
#+AUTHOR:
#+OPTIONS: ':nil *:t -:t ::t <:t H:4 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not "LOGBOOK") date:t
#+OPTIONS: e:t email:nil f:t inline:t num:nil p:nil pri:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t toc:nil todo:t |:t
#+OPTIONS: html-postamble:nil tex:mathjax
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export
#+PROPERTY: header-args :results output :exports both :noweb strip-export :tangle no :mkdirp yes
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="./body.css"/>
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="./theme.css"/>
#+HTML_HEAD_EXTRA: <script>window.MathJax || document.write('<script type="text/x-mathjax-config">MathJax.Hub.Config({"HTML-CSS":{imageFont:null}});<\/script><script src="/home/lev/src/MathJax/MathJax.js?config=TeX-AMS_HTML-full"><\/script>')</script>

#+OPTIONS:
# Local Variables:
# org-confirm-babel-evaluate: nil
# org-babel-exp-code-template: "#+BEGIN_SRC %lang%switches%flags\n%body\n#+END_SRC"
# End:

#+NAME: solidity-skeleton
#+BEGIN_SRC sol :tangle "src/end.sol" :exports none
  /// end.sol -- global settlement engine

  // <<license>>

  pragma solidity >=0.5.0;
  pragma experimental ABIEncoderV2;

  contract VatLike {
      struct Ilk {
          uint256 rate;
          uint256 Art;
          uint256 spot;
          uint256 line;
          uint256 dust;
      }
      struct Urn {
          uint256 ink;
          uint256 art;
      }
      function sin(bytes32) public view returns (uint);
      function dai(bytes32 lad) public returns (uint256);
      function ilks(bytes32 ilk) public returns (Ilk memory);
      function urns(bytes32 ilk, bytes32 urn) public returns (Urn memory);
      function move(bytes32 src, bytes32 dst, int256 rad) public;
      function flux(bytes32 ilk, bytes32 src, bytes32 dst, int256 rad) public;
*** socialising proportionally to debt

Here's a simple way we can compute the (exact) numerical solution using a bisection method:

#+BEGIN_SRC python :results output
  WAD = 10**18
  RAY = 10**27

  def rmul(x, y):
      return (x * y) // RAY

  def solve_by_bisection(f, toe, hat, tol=1, tries=1000):
      for _ in range(tries):
          cut = (toe + hat) // 2
          if f(cut) > tol:
              hat = cut
          elif f(cut) < -tol:
              toe = cut
          else:
              return cut

  Art  = 18 * WAD
  rate = RAY
  p    = 2

  inks = [10 * WAD, 1 * WAD]
  arts = [15 * WAD, 3 * WAD]

  f = lambda tag: p * sum([min(ink, rmul(rmul(art, rate), tag)) for ink, art in zip(inks, arts)]) - rmul(Art, rate)

  print(solve_by_bisection(f, 0, RAY))
#+END_SRC

#+RESULTS:
: 533333333333333333358631380

i.e. CDPs are settled at an implied price of \( 0.533\ldots^{-1} = 1.875 \), lower than the true price of \( 2.0 \).

#+NAME: test-cage-undercollateralised-dai-parity-debt
#+BEGIN_SRC sol
  function test_cage_undercollateralised_dai_parity_debt() public {
      // make a CDP:
      urn1 = bytes32(bytes20(address(this)));
      gemA.join(urn1, 10 ether);
      vat.frob("gold", urn1, urn1, urn1, 10 ether, 15 ether);
      // this urn has 0 gem, 10 ink, 15 tab, 15 dai

      // make a second CDP:
      urn2 = bytes32(uint256(bytes32(bytes20(address(this)))) + 1);
      gemA.join(urn2, 1 ether);
      vat.frob("gold", urn2, urn2, urn2, 1 ether, 3 ether);
      // this urn has 0 gem, 1 ink, 3 tab, 3 dai

      // global checks:
      assertEq(vat.debt(), rad(18 ether));
      assertEq(vat.vice(), 0);

      // tag and fix computation
      uint hump = 0;
      // CDP holders settled at price of 1.875
      uint tag = 533333333333333333358631380;
      // DAI holders get 1.0
      uint fix = RAY / 2;
      end.cage(hump);
      end.cage("gold", tag, fix);
      end.skim("gold", urn1);
      end.skim("gold", urn2);

      // local checks
      assertEq(art("gold", urn1), 0);
      assertEq(ink("gold", urn1), 2 ether);
      assertEq(art("gold", urn2), 0);
      assertEq(ink("gold", urn2), 0);
      assertEq(vat.sin(bytes32(bytes20(address(end)))), rad(18 ether));

      // global checks
      assertEq(vat.debt(), rad(18 ether));
      assertEq(vat.vice(), rad(18 ether));

      // CDP closing
      end.free("gold");
      assertEq(ink("gold", urn1), 0);
      assertEq(gem("gold", urn1), 2 ether);
      gemA.exit(urn1, address(this), 2 ether);

      // first dai redemption
      end.shop(15 ether);

      // global checks:
      assertEq(vat.debt(), rad(3 ether));
      assertEq(vat.vice(), rad(3 ether));

      end.pack("gold");
      end.cash("gold");

      // local checks:
      assertEq(dai(urn1), 0);
      assertEq(gem("gold", urn1), rmul(fix, 15 ether));
      gemA.exit(urn1, address(this), rmul(fix, 15 ether));

      // gather remaining dai into urn1
      daiM.move(urn2, urn1, 3 ether);
      // second dai redemption
      end.shop(3 ether);

      // global checks:
      assertEq(vat.debt(), 0);
      assertEq(vat.vice(), 0);

      end.pack("gold");
      end.cash("gold");

      // local checks:
      assertEq(dai(urn1), 0);
      assertEq(gem("gold", urn1), rmul(fix, 3 ether));
      gemA.exit(urn1, address(this), rmul(fix, 3 ether));

      assertEq(gem("gold", bytes32(bytes20(address(end)))), 0);
      // some dust remains in the adapter because of rounding:
      assertTrue(gold.balanceOf(address(gemA)) < 2);
  }
#+END_SRC

